Autodesk.Revit.DB.ViewSchedule.HasImageField
Checks whether the schedule definition includes any image-related fields and if any elements in the schedule actually have images in those fields.
Remarks:
This method may return an incorrect value if the data of the schedule view is out of date. Check IsDataOutOfData(),
and call Autodesk.Revit.DB.ViewSchedule.RefreshData to ensure that the return value is correct.
Returns:
True if the schedule has at least one image field showing at least one image, false otherwise
Since:
2015